List<Map<String, dynamic>> guide = <Map<String, dynamic>>[
  {
    "image_url": "assets/images/intro/diet_planning_intro.png",
    "title": "راهنمای برنامه غذایی",
    "question": "چگونه میتوانم یک برنامه غذایی دریافت و آن را مدیریت کنم؟",
    "steps_and_tips": [
      "شما میتوانید برنامه غذایی خود را بر اساس سه شیوه یعنی استفاده از برنامه های پیشفرض، ایجاد برنامه غذایی دلخواه و تهیه برنامه غذایی با استفاده از هوش مصنوعی تهیه کنید",
      "در شیوه برنامه غذایی پیشفرض سه نوع برنامه غذایی که مناسب افراد دارای اضافه وزن، افراد که نیاز به تثبیت وزن و افراد دارای کمبود وزن تهیه شده است که میتوانید از آنها استفاده کنید",
      "در شیوه برنامه غذایی دلخواه میتوانید برنامه غذایی خود را که از دکتر متخصص یا دیگر افراد دریافت کرده اید ایجاد کنید",
      "در شیوه تهیه برنامه غذایی توسط هوش مصنوعی میتوانید برنامه غذایی مناسب نیاز بدن خود را بر اساس شش گروه غذایی تهیه کنید",
      "برای تهیه برنامه از قسمت صفحه اصلی برنامه بخش رژیم غذایی را از منو پایین صفحه انتخاب کنید",
      "در مرحله اول برای تشخیص شاخص توده بدنی خود اطلاعات مورد نیاز را تکمیل کنید",
      "در مرحله بعد شاخص توده بدنی خود را مشاهده کرده و توضیحات مورد نیاز را مطالعه فرمائید",
      "در مرحله بعد فعالیت روزانه خود را مشخص نموده و متابولیسم بدنی خود را که شامل کالری، پروتئین، کربوهیدرات و چربی مورد نیاز روزانه میشود را مطالعه نمائید",
      "در مرحله بعد شیوه برنامه غذایی خود را انتخاب نموده و برنامه غذایی مورد نیاز خود را تهیه کنید",
      "توجه کنید که همه برنامه هایی غذایی به صورت هفتگی بوده و پس از پایان یک هفته، برنامه غذایی به صورت خودکار حذف شده و میتوانید نسبت به دریافت برنامه غذایی جدید اقدام کنید",
      "پس از دریافت برنامه غذایی از قسمت صفحه اصلی برنامه بخش پروفایل و سپس برنامه غذایی من میتوانید مدیریت لازم را بر روی برنامه غذایی خود انجام دهید",
      "در صورت هرگونه مشکل در برنامه غذایی میتوانید برنامه غذایی خود را حذف کنید و برنامه غذایی جدیدی تهیه کنید",
      "همچنین برای دسترسی سریع به برنامه های غذایی بدون نیاز به انجام تست شاخص توده بدنی و متابولیسم بدن میتوانید از قسمت صفحه اصلی منو سمت راست را باز کرده و گزینه دریافت برنامه غذایی را انتخاب کنید"
    ],
  },
  {
    "image_url": "assets/images/intro/targeting_intro.png",
    "title": "راهنمای هدف گذاری",
    "question": "چگونه میتوانم یک هدف ایجاد کنم و مدیریت روزانه آن را انجام دهم؟",
    "steps_and_tips": [
      "شما میتوانید اهدف خود را در دسته بندی های مختلف ایجاد و یادآورهای مورد نظر خود را برای اطلاع رسانی تنظیم کنید",
      "برای ایجاد یک هدف از قسمت صفحه اصلی  برنامه بخش اهداف را از منو پایین انتخا کنید و نسبت به ساخت یک هدف جدید اقدام نمائید",
      "در مرحله اول ساخت هدف دسته بندی مورد نظر هدف خود را انتخاب کنید",
      "سپس در مرحله بعد تگ های مورد نظر خود را انتخاب کنید",
      "در مرحله آخر نسبت به تکمیل اطلاعات هدف مانند عنوان هدف، تاریخ شروع و پایان هدف، توضیحات هدف، یادآورهای هدف و تسک های هدف اقدام کنید",
      "در قسمت یادآورهای هدف شما میتوانید یادآورهای خود را برای اطلاع رسانی تنظیم کنید که امکان تنظیم آن برای روزهای هفته مقدور است و تا پایان هدف اطلاع رسانی ها در زمان های مشخص شده اعمال خواهند شد",
      "همچنین در قسمت تسک ها میتوانید تسک های مورد نظر خود را ایجاد کنید و در طول هدف آنها را انجام دهید",
      "در آخر نسبت به ایجاد هدف اقدام کنید و هدف ساخته شده خود را در قسمت صفحه اصلی برنامه بخش اهداف دنبال کنید",
      " با کلیک بر روی هر هدف میتوانید به جزئیات آن هدف دسترسی داشته باشید که در این صفحه میتوانید روزهای هدف خود را مدیریت کنید و برای هر روز رویکرد خود را ثبت کنید و تسک های ایجاد شده را تکمیل کنید",
      "توجه کنید که بعد از پایان تاریخ هدف، هدف مورد نظر به بخش اهداف تکمیل شده منتقل خواهد شد",
    ],
  },
  {
    "image_url": "assets/images/intro/article_and_sport_intro.png",
    "title": "راهنمای تمرینات و مقالات",
    "question": "چگونه میتوانم به مقالات و تمرینات یوگا و ورزش در همراه سلامت دسترسی داشته باشم؟",
    "steps_and_tips": [
      "برای دسترسی به مقالات برنامه میتوانید از قسمت صفحه اصلی برنامه نسبت به مشاهده مقالات اقدام نمائید",
      "همچنین برای دسترسی به آموزش های یوگا و ورزش همراه سلامت میتوانید از قسمت صفحه اصلی برنامه بر روی دسته بندی مورد نظر کلیک کنید",
      "آموزش های یوگا و ورزش همراه با انیمیشن و مراحل انجام حرکت تهیه شده است تا بتوانید به آسانی از آنها استفاده کنید"
    ],
  }
];
