import 'package:flutter/material.dart';

List<Map<String, dynamic>> sportExercises = <Map<String, dynamic>>[
  {
    "title": "ددباگ",
    "lottie_url": "assets/lottie/sport_exercises/deadbug.json",
    "description": "تمرین ددباگ شکل متفاوت و متنوع از حرکات شکم بودهکه چند مفصلی نیز می‌باشد. این تمرین که به حشره مرده نیز نامیده می‌شود، یکی از پرکاربردترین تمرینات در بین تمام تمرینات شکم است",
    "perform_movements": [
      "به صورت طاق باز روی زمین خوابیده و دست‌ها را به سمت بالا نگه دارید",
      "سپس پاها را بالا آورده و زانوها را با زاویه 90 درجه خم کنید. این نقطه شروع حرکت می‌باشد و بسیار مهم است تا پشت خود را کاملا صاف به زمین تکیه دهید",
      "به آرامی دست راست و پای چپ خود را همزمان و با عمل بازدم پایین می‌آوریم تا زمانی که هر دو نزدیک زمین باشد.دقت کنید تا پشت خود را از زمین جدا نکنید",
      "سپس به آرامی به نقطه شروع برگشته و حرکت را با دست و پای دیگر انجام دهید",
      "ممکن است حرکت در تکرار های اولیه بسیار آسان به نظر بیاید ولی اگر سعی کنید عضلات شکم را درگیر کرده و پشتتان را از زمین جدا نکنید، متوجه خواهید شد که انجام حرکت بسیار سخت است",
    ],
    "color": Colors.white,
  },
  {
    "title": "لانگز پرشی",
    "lottie_url": "assets/lottie/sport_exercises/jumping_lunges.json",
    "description": "لانگز پرشی از حرکات چند مفصلی و پیشرفته در بین فرم‌های Lunges می‌باشد که برای تقویت عضلات پا کاربرد دارد. این تمرین در گروه تمرینات پا با وزن بدن قرار می‌گیرد",
    "perform_movements": [
      "برای اجرای این حرکت ابتدا به گونه‌ای بایستید که کف دست رو به بدن ، دیک دست کاملا آزاد و در کنار بدن و دست دیگر زاویه نود درجه داشته باشد و یا بصورت جمع در جلوی بدن باشد، حالت اول برای حفظ تعادل بهتر است. یک پا به جلو و یک پا به عقب (یک پا کمی کمتر از اندازه دو برابر کف پای شما رو به جلو و پای دیگر هم به همان میزان رو به عقب برود) ، قامت کاملا صاف ، سر در راستای ستون فقرات ،  جهت پا ها رو به جلو و در یک راستا ، کف پای جلو روی زمین و پای عقب بر روی پنجه باشد. زانو باید به میزان تود درجه خم شده باشد. این نقطه شروع حرکت است",
      "اکنون با فشار از ناحیه عضلات چهار سر ران ، بران خود را به بالا پرتاب کنید و همزمان با پرتاب بدن پا های خود را با هم تزدیک کرده تا در لحظه اوج در کتار هم باشند. باید میزان نیروی وارده به حدی باشد که بدن را به میزانی بالا ببرید تا در اوج بتوان جایگاه پا ها هنگام فرود را با هم عوض کرد. اگر کم با بالا پرتاب شود پا ها به زمین گیر کرده و امکان آسیب زیاد وجود دارد. این بخش فاز مثبت حرکت است و در این فاز عمل بازدم را انجام دهید",
      "از لحظه‌ای که به اوج می‌رسید و فرود شروع می‌شود فاز منفی حرکت است. در این فاز در لحظه اوج باید پایی که عقب بوده را به جلو و پای جلو را به عقب هدایت کرده به گونه‌ای که بعد از فرود حالت لانگز دوباره شکل بگیرد. البته با این تفاوت که جای پا ها با هم عوض شده باشد. دقت کنید که زاویه زانو باید نود درجه باشد، مطابق نقطه شروع حرکت. در این فاز عمل دم را انجام دهید",
    ],
    "color": Colors.white,
  },
  {
    "title": "اسکوات بلغاری وزن بدن",
    "lottie_url": "assets/lottie/sport_exercises/bulgarian_split_squat_jump.json",
    "description": "حرکت اسکوات بلغاری وزن بدن جزو حرکات چند مفصلی موثر برای تقویت عضلات پا می‌باشد که در دسته تمرینات پا با وزن بدن دسته‌بندی می‌شود",
    "perform_movements": [
      "برای انجام این حرکت ابتدا یک جلوی نیمکت با ارتفاع مناسب (به اندازه‌ای که تا زیر زانوی شما باشد) بایستید. فاصله تقریبا دو و نیم برابر ران خود از نیمکت باشد. دست‌ها را به کمر (برای حفظ بهتر تعادل) و یا در روبرو بگیرید. پا ها را به اندازه عرض شانه باز کنید و یک پا را به عقب برده و پنجه پا و یا روی پا را بر روی لبه نیمکت بگذارید. کمر صاف ، سر در راستای ستون فقرات و نگاه به جلو باشد. این نقطه شروع حرکت است",
      "اکنون به پایین بروید تا جاییکه زاویه زانوی پای جلو نود درجه شود. این بخش فاز منفی حرکت است و در این فاز عمل دم را انجام دهید",
      "حال با ایجاد فشار از عضله هدف بدن را به بالا پرس کنید. این بخش فاز مثبت حرکت بوده و در این فاز عمل بازدم ر انجام دهید",
    ],
    "color": Colors.white,
  },
  {
    "title": "حرکت کششی کبری",
    "lottie_url": "assets/lottie/sport_exercises/cobra.json",
    "description": "حرکت کششی کبری (cobra pose) یکی از تاثیر گذار ترین حرکات برای تقویت عضلات فیله کمر است؛ در این حرکت عضله هدف ما فیله کمر و عضله های کمکی ما عضلات باسن هست",
    "perform_movements": [
      "ابتدا روبه شکم روی مَت دراز بکشید، و دست هایتان را در راستای سینه روی مَت بگذارید",
      "سپس به آرامی با منقبض کردن باسن شروع به بلند کردن بدن از قسمت بالا تنه شوید، و این کار را تا جایی که آرنج هایتان صاف شود ادامه دهید",
      "بعد هنگامی که دست هایتان صاف شد در قسمت بالای حرکت مکث کوتاهی داشته باشد",
      "دوباره به نقطه شروع برگشته و حرکت را تکرار کنید",
    ],
    "color": Colors.white,
  },
  {
    "title": "درازکشیدن روی پهلو و فاصله‌دادن ران‌ها از یکدیگر",
    "lottie_url": "assets/lottie/sport_exercises/side_hipa_abduction.json",
    "description": "این تمرین عضلات خارج لگن و کپل ها را تقویت میکند",
    "perform_movements": [
      "به پهلوی سمت چپ روی زمین دراز بکشید و پاها را کاملا صاف و کشیده نگه دارید. پای چپ روی زمین قرار بگیرد و پای راست روی آن باشد",
      "درحالی‌که سایر قسمت‌های بدن را کاملا ثابت و بی‌حرکت نگه داشته‌اید، پای راست را بلند کنید و از پای چپ فاصله دهید",
      "بعد هنگامی که دست هایتان صاف شد در قسمت بالای حرکت مکث کوتاهی داشته باشد",
      "سپس به حالت ابتدایی برگردید. چند بار دیگر همین کار را تکرار کنید و سپس روی پهلوی دیگر، تمرین را انجام دهید",
    ],
    "color": Colors.white,
  },
];
