import 'package:flutter/material.dart';

List<Map<String, dynamic>> yogaExercises = <Map<String, dynamic>>[
  {
    "title": "حرکت مثلث پیچ",
    "lottie_url": "assets/lottie/yoga_exercises/revolved_triangle.json",
    "description": "این حرکت باعث تقویت عضلات روی ران، پشت ران، ساق پا، لگن و پشت میشود",
    "perform_movements": [
      "در حرکت تادآسانا بایستید",
      "با بازدم، از لگن به جلو خم شوید و پای چپ را در پشت خود قرار دهید، به صورتی که انگشتان۴۵ درجه به بیرون باشند",
      "مطمئن شوید که لگن و سینه رو به جلوی مت و صاف هستند",
      "با دم، کف دست چپ را به بیرون پای راست بیاورید",
      "با بازدم، شانه‌ها را به راست بچرخانید و دست راست را رو به آسمان بکشید",
      "وقتی آماده بودید، سر را بچرخانید و به بالا به سوی دست راست نگاه کنید",
      "به مدت سی ثانیه تا یک دقیقه در این حرکت بمانید",
      "برای خارج شدن، با بازدم، هر دو دست را روی زمین بیاورید و با پاها به جلو قدم بردارید. با دم به تادآسانا بازگردید",
    ],
    "color": Colors.white,
  },
  {
    "title": "حرکت جنگجو",
    "lottie_url": "assets/lottie/yoga_exercises/warrior.json",
    "description": "این حرکت شانه ها، بازوها و عضلات پشت را تقویت میکند و همچنین باعث تقویت و کشش ران، ساق و مچ پا میشود",
    "perform_movements": [
      "در حالت ایستاده، پاها در یک راستا و صاف روی زمین قرار دهید",
      "پای عقب را با زاویه 60 درجه با سطح زمین باز کنید",
      "زانو پای جلو را نیز با زاویه 90 درجه دقیقا در امتداد مچ پا خم کنید",
      "بازوها به سمت آسمان کشیده شده و عضلات دوسر در کنار گوش قرار گیرند",
      "دستها میتوانند کنار هم باشند یا از هم جدا و رو به روی هم قرار گیرند",
      "در تمامی مراحل حرکات نگاه رو به جلو باشد",
    ],
    "color": Colors.white,
  },
  {
    "title": "حرکت درخت",
    "lottie_url": "assets/lottie/yoga_exercises/tree.json",
    "description": "انجام حرکت درخت به جوان ماندن بدن کمک می‌کند، باعث ایجاد نشاط و شادابی در فرد میشود. علاوه بر این آسانای درخت در یوگا باعث قوت بخشیدن قوزک پا، ران‌ها، ستون فقرات و شانه‌ها می‌شود و در بهبود کف پای صاف هم مؤثر است",
    "perform_movements": [
      "در حالت تاد آسانا بر روی زیرانداز یوگای خود قرار گرفته و بایستید",
      "سعی کنید تمام وزن بدن خود را بر روی کف پای راستتان ببرید",
      "سپس پای چپتان را از قسمت زانو خم کنید",
      "با کمک دست‌هایتان، کف پا را داخل و بالای ران راست خود قرار دهید، به صورتی که انگشتان پای شما به سمت زمین باشند",
      "یادتان باشد که کف پای خود را هرگز بر روی زانویتان نگذارید، به دلیل اینکه ممکن است با ایجاد فشار بر روی آن، زانو آسیب ببیند",
      "در صورتی که نمی‌توانید پایتان را تا انتهای ران بالا ببرید، بهتر است پای خود را به نحوی که زیر هم قرار بگیرند، نگه دارید",
      "حالا پای راستتان را بکشید و عضله بالای زانوی خود را منقبض نمایید",
      "در حالی که پای چپ خود را به انتهای استخوان رانتان فشار می‌دهید، سعی کنید زانوی چپتان را به سمت عقب بکشید تا بر سطح بدنتان عمود باشد",
      "با انجام عمل دم، دست‌هایتان را به آرامی از دو طرف بدن بالا بیاورید، به صورتی که کف دست‌های شما یکدیگر را لمس کنند یا اینکه روی هم قرار بگیرند",
      "اکنون به یک نقطه ثابت در مقابل خود خیره شوید تا بتوانید بهتر تعادل خود را در طول حرکت درخت در ورزش یوگا روی یک پا نگه دارید",
      "شما می‌توانید برای حفظ تعادل انگشت شصت خود را بر روی زمین فشار دهید",
      "در وضعیت درخت برای چند ثانیه باقی بمانید و سپس حرکت را برای سمت دیگر بدن هم انجام دهید",
    ],
    "color": Colors.white,
  },
];
