class BMIStatusFormatter {
  static const normalWeightStatus = "خوشبختانه وزنت طبیعی";
  static const underWeightStatus = "متاسفانه دارای کمبود وزن می باشید!";
  static const overWeightStatus = "متاسفانه دارای اضافه وزن می باشید!";

  static const normalWeightDescription =
      "شما در محدوده وزن طبیعی هستید. این به این معناست که شما در وضعیت مناسبی از لحاظ سلامت وزن قرار دارید. ادامه دادن به یک رژیم غذایی متعادل و ورزش منظم می‌تواند به شما کمک کند تا وزن خود را در این محدوده نگه دارید و از فواید سلامت آن بهره‌مند شوید. به یاد داشته باشید که حفظ عادات سالم مهم‌تر از اعداد و ارقام است.";
  static const underWeightStatusDescription =
      "شاخص توده بدنی شما نشان‌دهنده کمبود وزن است. کمبود وزن می‌تواند به مشکلاتی مانند ضعف سیستم ایمنی، کم‌خونی و مشکلات استخوانی منجر شود. پیشنهاد می‌شود با یک متخصص تغذیه مشورت کنید تا یک برنامه غذایی مغذی و متعادل برای افزایش وزن سالم به شما ارائه دهد. تمرکز بر مصرف مواد غذایی پرکالری و مغذی و افزایش تدریجی وزن به شما کمک می‌کند تا به وزن سالم‌تری برسید و از فواید سلامتی آن بهره‌مند شوید.";
  static const overWeightStatusDescription =
      "شاخص توده بدنی شما نشان‌دهنده اضافه وزن است. اضافه وزن می‌تواند به مرور زمان به مشکلات سلامتی مانند دیابت نوع ۲، بیماری‌های قلبی و فشار خون بالا منجر شود. پیشنهاد می‌شود با یک متخصص تغذیه مشورت کنید تا یک برنامه غذایی مناسب برای کاهش وزن به شما ارائه دهد و همچنین فعالیت بدنی منظم را به برنامه روزانه خود اضافه کنید. هدف شما باید بهبود سلامتی و کیفیت زندگی باشد.";
}
