Map<String, dynamic> dietPlanForObesePeople = {
  "diet_plan_days": [
    {
      "title": "روز اول",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["تخم مرغ مخلوط شده با اسفناج و گوجه فرنگی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["سالاد تن ماهی با کاهو", "خیار و گوچه فرنگی"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["لوبیا پلو با فلفل قرمز و گل کلم"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["برش های سیب و کره بادام زمینی"]
        }
      ]
    },
    {
      "title": "روز دوم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["بلغور جو دوسر به همراه بلوبری", "شیر و مفزها"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["حمص و رپ سبزیجات(غذایی که سبزیجات پخته شده را در نان می پیچند)"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["سالمون به همراه کنجد", "کلم قرمز", "پودره سیب زمینی شیرین"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["نارنگی", "بادام زمینی"]
        }
      ]
    },
    {
      "title": "روز سوم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["پوره آووکادو", "تخم مرغ سرخ شده روی یک اسلایس از نان روگن"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["کینوا بروکلی", "بادام زمینی برشته شده"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["مرغ سرخ کرده", "نودل سوبا"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["بلوبری", "ماست نارگیل"]
        }
      ]
    },
    {
      "title": "روز چهارم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["اسموتی با پودر پرتئین", "انواع توت ها و شیر جو دو سر"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["سالاد مرغ با کاهو و ذرت"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["سبزیجات سرخ شده مدیترانه ای", "عدس و سس تاهینی(ارده)"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["کیک برنج غلات کامل با کرده تهیه شده از مغز"]
        }
      ]
    },
    {
      "title": "روز پنجم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["پنکیک گندم سیاه با تمشک و ماست یونانی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["سوپ سبزیجات", "دو عدد کیک جو دوسر"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["ماهی تاکو با سلاد کلم"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["تخم مرغ آب پز با برش هایی از نان پیتا"]
        }
      ]
    },
    {
      "title": "روز ششم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["اسلایس سیب با کره بادام زمینی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["املت نخودفرنگی", "پنیر فتا"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["سیب زمینی شیرین پخته شده به همراه سینه مرغ و سبزیجات"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["توپ کاکائو پروتئینی"]
        }
      ]
    },
    {
      "title": "روز هفتم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["کلوچه صبحانه با تخم مرغ و سبزیجات"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["کاسه توفو ترد"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["عدس با سس بولونز", "نودل کدو سبز"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["برش هویج و حمص"]
        }
      ]
    }
  ]
};

Map<String, dynamic> dietPlanForThinPeople = {
  "diet_plan_days": [
    {
      "title": "روز اول",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["ساندویچ لقمه بوریتو گیاهی", "یک پیمانه توت فرنگی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["سالاد پاستا", "تن ماهی", "سبزیجات"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["یک و نیم پیمانه برنج قهوه ای", "یک پیمانه از انواع خورشت(حاوی گوشت و سبزی)"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["یک عدد سیب", "یک قاشق غذاخوری کره بادام زمینی"]
        }
      ]
    },
    {
      "title": "روز دوم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["اسموتی انبه، هلو و توت فرنگی", "یک عدد تخم مرغ آب پز"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["ساندویچ گوشت و سبزیجات", "یک قاشق چایخوری کره بدون نمک"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["100 گرم استیک گوشت", "2 پیمانه اسفناج پخته", "یک دوم پیمانه هویج رنده شده همراه با روغن زیتون"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["پنج عدد هویج", "سه قاشق غذاخوری ارده", "یک عدد پرتقال"]
        }
      ]
    },
    {
      "title": "روز سوم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["2 پیمانه گرانولا و آجیل"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["ساندویچ گوشت و سبزیجات"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["2 پیمانه ماکارونی همراه با گوشت و قارچ"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["1 ورقه پنیر سوئیسی", "1 کف دست نان گندم"]
        }
      ]
    },
    {
      "title": "روز چهارم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["2 پیمانه گرانولا و آجیل"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["220 گرم ماهی و 2 کف دست نان کامل", "سالاد سبزیجات"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["100 گرم سینه مرغ", "1 پیمانه سالاد سیب زمینی", "1 پیمانه خوراک لوبیا"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["پنج عدد هویج", "یک چهارم پیمانه ارده", "یک عدد پرتقال"]
        }
      ]
    },
    {
      "title": "روز پنجم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["یک لیوان اسموتی انبه و هلو و توت فرنگی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["1 سروینگ خوارک مرغ همراه با سبزیجات پخته", "یک کف دست نان کامل"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["2 سروینگ سالاد تن ماهی با سبزیجات", "یک کف دست نان گندم کامل"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["یک عدد غلات بار"]
        }
      ]
    },
    {
      "title": "روز ششم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["یک لیوان اسموتی انبه و هلو و توت فرنگی", "یک عدد پرتقال", "دو عدد تخم مرغ آب پز"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["ساندویچ مرغ با لوبیا سبز وآووکادو", "1 پیمانه توت فرنگی"],
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["2 سروینگ سالاد حبوبات و سبزیجات"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["یک عدد سیب", "یک قاشق غذاخوری کره بادام زمینی"]
        }
      ]
    },
    {
      "title": "روز هفتم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["ساندویچ لقمه بوریتو گیاهی", "یک عدد موز", "دو قاشق غذاخوری کره بادام زمینی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["ساندویچ مرغ با لوبیا و آووکادو"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["150 گرم ماهی سالمون همراه با اسفناج پخته", "سه چهارم پیمانه برنج قهوه ای"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["170 گرم ماست یونانی", "نصف پیمانه توت فرنگی", "یک قاشق غذاخوری عسل"]
        }
      ]
    },
  ]
};

Map<String, dynamic> dietPlanForWeightStabilization = {
  "diet_plan_days": [
    {
      "title": "روز اول",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["اسموتی انبه، هلو و توت فرنگی", "یک عدد تخم مرغ آب پز"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["سالاد پاستا", "تن ماهی", "سبزیجات"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["یک و نیم پیمانه برنج قهوه ای", "یک پیمانه از انواع خورشت(حاوی گوشت و سبزی)"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["برش های سیب و کره بادام زمینی"]
        }
      ]
    },
    {
      "title": "روز دوم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["بلغور جو دوسر به همراه بلوبری", "شیر و مفزها"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["ساندویچ گوشت و سبزیجات", "یک قاشق چایخوری کره بدون نمک"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["سالمون به همراه کنجد", "کلم قرمز", "پودر سیب زمینی شیرین"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["یک عدد سیب", "یک قاشق غذاخوری کره بادام زمینی"]
        }
      ]
    },
    {
      "title": "روز سوم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["2 پیمانه گرانولا و آجیل"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["کینوا بروکلی", "بادام زمینی برشته شده"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["100 گرم استیک گوشت", "2 پیمانه اسفناج پخته", "یک دوم پیمانه هویج رنده شده همراه با روغن زیتون"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["1 ورقه پنیر سوئیسی", "1 کف دست نان گندم"]
        }
      ]
    },
    {
      "title": "روز چهارم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["اسلایس سیب با کره بادام زمینی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["220 گرم ماهی و 2 کف دست نان کامل", "سالاد سبزیجات"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["100 گرم سینه مرغ", "1 پیمانه سالاد سیب زمینی", "1 پیمانه خوراک لوبیا"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["تخم مرغ آب پز با برش هایی از نان پیتا"]
        }
      ]
    },
    {
      "title": "روز پنجم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["اسموتی با پودر پرتئین", "انواع توت ها و شیر جو دو سر"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["سوپ سبزیجات", "دو عدد کیک جو دوسر"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["ماهی تاکو با سلاد کلم"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["یک عدد غلات بار"]
        }
      ]
    },
    {
      "title": "روز ششم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["ساندویچ لقمه بوریتو گیاهی", "یک عدد موز", "دو قاشق غذاخوری کره بادام زمینی"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["املت نخودفرنگی", "پنیر فتا"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["2 سروینگ سالاد حبوبات و سبزیجات"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["170 گرم ماست یونانی", "نصف پیمانه توت فرنگی", "یک قاشق غذاخوری عسل"]
        }
      ]
    },
    {
      "title": "روز هفتم",
      "meals": [
        {
          "name": "صبحانه",
          "status": null,
          "edibles": ["کلوچه صبحانه با تخم مرغ و سبزیجات"]
        },
        {
          "name": "ناهار",
          "status": null,
          "edibles": ["کاسه توفو ترد"]
        },
        {
          "name": "شام",
          "status": null,
          "edibles": ["ساندویچ مرغ با لوبیا و آووکادو"]
        },
        {
          "name": "میان وعده",
          "status": null,
          "edibles": ["توپ کاکائو پروتئینی"]
        }
      ]
    }
  ]
};
